Ran Plan for dir: `terragrunt/kubernetes/authentik` workspace: `terragrunt_kubernetes_authentik`

<details><summary>Show Output</summary>

```diff
Authenticated

03:08:51.142 INFO   Downloading Terraform configurations from . into ./.terragrunt-cache/K6-Vts1EL4ZSJUTSNt35qO8rCyw/2itDFZA842PsBi7ld8tx1X_wPCw
03:08:51.178 INFO   tofu: Initializing the backend...
03:08:51.449 INFO   tofu: Initializing provider plugins...
03:08:51.449 INFO   tofu: - Reusing previous version of aminueza/minio from the dependency lock file
03:08:51.681 INFO   tofu: - Reusing previous version of cloudflare/cloudflare from the dependency lock file
03:08:51.830 INFO   tofu: - Reusing previous version of hashicorp/vault from the dependency lock file
03:08:51.951 INFO   tofu: - Reusing previous version of telmate/proxmox from the dependency lock file
03:08:52.075 INFO   tofu: - Reusing previous version of hashicorp/kubernetes from the dependency lock file
03:08:52.192 INFO   tofu: - Reusing previous version of hashicorp/helm from the dependency lock file
03:08:52.298 INFO   tofu: - Reusing previous version of goauthentik/authentik from the dependency lock file
03:08:52.434 INFO   tofu: - Reusing previous version of gavinbunney/kubectl from the dependency lock file
03:08:52.531 INFO   tofu: - Using previously-installed hashicorp/vault v4.8.0
03:08:52.541 INFO   tofu: - Using previously-installed telmate/proxmox v3.0.1-rc8
03:08:52.573 INFO   tofu: - Using previously-installed hashicorp/kubernetes v2.36.0
03:08:52.606 INFO   tofu: - Using previously-installed hashicorp/helm v3.0.0-pre2
03:08:52.625 INFO   tofu: - Using previously-installed goauthentik/authentik v2025.4.0
03:08:52.659 INFO   tofu: - Using previously-installed gavinbunney/kubectl v1.19.0
03:08:52.673 INFO   tofu: - Using previously-installed aminueza/minio v3.5.0
03:08:52.749 INFO   tofu: - Using previously-installed cloudflare/cloudflare v5.4.0
03:08:52.749 INFO   tofu: OpenTofu has been successfully initialized!
03:08:53.555 STDOUT tofu: OpenTofu used the selected providers to generate the following execution
03:08:53.555 STDOUT tofu: plan. Resource actions are indicated with the following symbols:
03:08:53.555 STDOUT tofu:   ~ update in-place
03:08:53.555 STDOUT tofu: OpenTofu will perform the following actions:
03:08:53.555 STDOUT tofu:   # helm_release.authentik will be updated in-place
03:08:53.558 STDOUT tofu:   ~ resource "helm_release" "authentik" {
03:08:53.558 STDOUT tofu:       ~ id                         = "authentik" -> (known after apply)
03:08:53.558 STDOUT tofu:       ~ metadata                   = {
03:08:53.559 STDOUT tofu:           ~ app_version    = "2025.8.3" -> (known after apply)
03:08:53.559 STDOUT tofu:           ~ chart          = "authentik" -> (known after apply)
03:08:53.559 STDOUT tofu:           ~ first_deployed = 1759115175 -> (known after apply)
03:08:53.559 STDOUT tofu:           ~ last_deployed  = 1759115175 -> (known after apply)
03:08:53.559 STDOUT tofu:           ~ name           = "authentik" -> (known after apply)
03:08:53.559 STDOUT tofu:           ~ namespace      = "authentik" -> (known after apply)
03:08:53.559 STDOUT tofu:           ~ revision       = 1 -> (known after apply)
03:08:53.559 STDOUT tofu:           ~ values         = jsonencode(
03:08:53.559 STDOUT tofu:                 {
03:08:53.559 STDOUT tofu:                   - authentik  = {
03:08:53.559 STDOUT tofu:                       - bootstrap_email = "youri@youhide.com.br"
03:08:53.559 STDOUT tofu:                       - email           = {
03:08:53.559 STDOUT tofu:                           - from     = "Authentik <postmaster@mg.tkasolutions.com.br>"
03:08:53.559 STDOUT tofu:                           - host     = "smtp.mailgun.org"
03:08:53.559 STDOUT tofu:                           - port     = 587
03:08:53.559 STDOUT tofu:                           - use_tls  = true
03:08:53.559 STDOUT tofu:                           - username = "postmaster@mg.tkasolutions.com.br"
03:08:53.559 STDOUT tofu:                         }
03:08:53.559 STDOUT tofu:                     }
03:08:53.559 STDOUT tofu:                   - global     = {
03:08:53.559 STDOUT tofu:                       - env = [
03:08:53.559 STDOUT tofu:                           - {
03:08:53.559 STDOUT tofu:                               - name      = "AUTHENTIK_SECRET_KEY"
03:08:53.559 STDOUT tofu:                               - valueFrom = {
03:08:53.560 STDOUT tofu:                                   - secretKeyRef = {
03:08:53.560 STDOUT tofu:                                       - key  = "authentik-secret-key"
03:08:53.560 STDOUT tofu:                                       - name = "authentik-secrets"
03:08:53.560 STDOUT tofu:                                     }
03:08:53.560 STDOUT tofu:                                 }
03:08:53.560 STDOUT tofu:                             },
03:08:53.560 STDOUT tofu:                           - {
03:08:53.560 STDOUT tofu:                               - name      = "AUTHENTIK_EMAIL__PASSWORD"
03:08:53.560 STDOUT tofu:                               - valueFrom = {
03:08:53.560 STDOUT tofu:                                   - secretKeyRef = {
03:08:53.560 STDOUT tofu:                                       - key  = "smtp-password"
03:08:53.560 STDOUT tofu:                                       - name = "authentik-secrets"
03:08:53.560 STDOUT tofu:                                     }
03:08:53.560 STDOUT tofu:                                 }
03:08:53.560 STDOUT tofu:                             },
03:08:53.560 STDOUT tofu:                           - {
03:08:53.560 STDOUT tofu:                               - name      = "AUTHENTIK_BOOTSTRAP_PASSWORD"
03:08:53.560 STDOUT tofu:                               - valueFrom = {
03:08:53.560 STDOUT tofu:                                   - secretKeyRef = {
03:08:53.560 STDOUT tofu:                                       - key  = "token"
03:08:53.560 STDOUT tofu:                                       - name = "authentik-secrets"
03:08:53.560 STDOUT tofu:                                     }
03:08:53.560 STDOUT tofu:                                 }
03:08:53.560 STDOUT tofu:                             },
03:08:53.560 STDOUT tofu:                           - {
03:08:53.560 STDOUT tofu:                               - name      = "AUTHENTIK_BOOTSTRAP_TOKEN"
03:08:53.560 STDOUT tofu:                               - valueFrom = {
03:08:53.560 STDOUT tofu:                                   - secretKeyRef = {
03:08:53.561 STDOUT tofu:                                       - key  = "token"
03:08:53.561 STDOUT tofu:                                       - name = "authentik-secrets"
03:08:53.561 STDOUT tofu:                                     }
03:08:53.561 STDOUT tofu:                                 }
03:08:53.561 STDOUT tofu:                             },
03:08:53.561 STDOUT tofu:                           - {
03:08:53.561 STDOUT tofu:                               - name      = "POSTGRES_PASSWORD"
03:08:53.561 STDOUT tofu:                               - valueFrom = {
03:08:53.561 STDOUT tofu:                                   - secretKeyRef = {
03:08:53.561 STDOUT tofu:                                       - key  = "postgresql-password"
03:08:53.561 STDOUT tofu:                                       - name = "authentik-secrets"
03:08:53.561 STDOUT tofu:                                     }
03:08:53.561 STDOUT tofu:                                 }
03:08:53.561 STDOUT tofu:                             },
03:08:53.561 STDOUT tofu:                         ]
03:08:53.561 STDOUT tofu:                     }
03:08:53.561 STDOUT tofu:                   - postgresql = {
03:08:53.561 STDOUT tofu:                       - auth    = {
03:08:53.561 STDOUT tofu:                           - existingSecret = "authentik-secrets"
03:08:53.561 STDOUT tofu:                           - secretKeys     = {
03:08:53.561 STDOUT tofu:                               - userPasswordKey = "postgresql-password"
03:08:53.561 STDOUT tofu:                             }
03:08:53.561 STDOUT tofu:                         }
03:08:53.561 STDOUT tofu:                       - enabled = true
03:08:53.561 STDOUT tofu:                       - primary = {
03:08:53.561 STDOUT tofu:                           - persistence = {
03:08:53.561 STDOUT tofu:                               - accessModes  = [
03:08:53.561 STDOUT tofu:                                   - "ReadWriteOnce",
03:08:53.562 STDOUT tofu:                                 ]
03:08:53.562 STDOUT tofu:                               - size         = "4Gi"
03:08:53.562 STDOUT tofu:                               - storageClass = "longhorn"
03:08:53.562 STDOUT tofu:                               - volumeName   = "authentik-postgres"
03:08:53.562 STDOUT tofu:                             }
03:08:53.562 STDOUT tofu:                         }
03:08:53.562 STDOUT tofu:                     }
03:08:53.562 STDOUT tofu:                   - redis      = {
03:08:53.562 STDOUT tofu:                       - enabled = true
03:08:53.562 STDOUT tofu:                       - master  = {
03:08:53.562 STDOUT tofu:                           - persistence = {
03:08:53.562 STDOUT tofu:                               - accessModes  = [
03:08:53.562 STDOUT tofu:                                   - "ReadWriteOnce",
03:08:53.562 STDOUT tofu:                                 ]
03:08:53.562 STDOUT tofu:                               - size         = "2Gi"
03:08:53.562 STDOUT tofu:                               - storageClass = "local-path"
03:08:53.562 STDOUT tofu:                               - volumeName   = "authentik-redis"
03:08:53.562 STDOUT tofu:                             }
03:08:53.562 STDOUT tofu:                         }
03:08:53.562 STDOUT tofu:                     }
03:08:53.562 STDOUT tofu:                   - server     = {
03:08:53.562 STDOUT tofu:                       - ingress = {
03:08:53.562 STDOUT tofu:                           - enabled          = true
03:08:53.562 STDOUT tofu:                           - hosts            = [
03:08:53.562 STDOUT tofu:                               - "auth.tkasolutions.com.br",
03:08:53.562 STDOUT tofu:                             ]
03:08:53.562 STDOUT tofu:                           - ingressClassName = "traefik"
03:08:53.563 STDOUT tofu:                         }
03:08:53.563 STDOUT tofu:                     }
03:08:53.563 STDOUT tofu:                 }
03:08:53.563 STDOUT tofu:             ) -> (known after apply)
03:08:53.563 STDOUT tofu:           ~ version        = "2025.8.3" -> (known after apply)
03:08:53.563 STDOUT tofu:         } -> (known after apply)
03:08:53.563 STDOUT tofu:         name                       = "authentik"
03:08:53.563 STDOUT tofu:       ~ values                     = [
03:08:53.563 STDOUT tofu:           - <<-EOT
03:08:53.563 STDOUT tofu:                 "authentik":
03:08:53.563 STDOUT tofu:                   "bootstrap_email": "youri@youhide.com.br"
03:08:53.563 STDOUT tofu:                   "email":
03:08:53.563 STDOUT tofu:                     "from": "Authentik <postmaster@mg.tkasolutions.com.br>"
03:08:53.563 STDOUT tofu:                     "host": "smtp.mailgun.org"
03:08:53.563 STDOUT tofu:                     "port": 587
03:08:53.563 STDOUT tofu:                     "use_tls": true
03:08:53.563 STDOUT tofu:                     "username": "postmaster@mg.tkasolutions.com.br"
03:08:53.563 STDOUT tofu:                 "global":
03:08:53.563 STDOUT tofu:                   "env":
03:08:53.563 STDOUT tofu:                   - "name": "AUTHENTIK_SECRET_KEY"
03:08:53.563 STDOUT tofu:                     "valueFrom":
03:08:53.563 STDOUT tofu:                       "secretKeyRef":
03:08:53.563 STDOUT tofu:                         "key": "authentik-secret-key"
03:08:53.563 STDOUT tofu:                         "name": "authentik-secrets"
03:08:53.563 STDOUT tofu:                   - "name": "AUTHENTIK_EMAIL__PASSWORD"
03:08:53.563 STDOUT tofu:                     "valueFrom":
03:08:53.563 STDOUT tofu:                       "secretKeyRef":
03:08:53.563 STDOUT tofu:                         "key": "smtp-password"
03:08:53.563 STDOUT tofu:                         "name": "authentik-secrets"
03:08:53.563 STDOUT tofu:                   - "name": "AUTHENTIK_BOOTSTRAP_PASSWORD"
03:08:53.563 STDOUT tofu:                     "valueFrom":
03:08:53.563 STDOUT tofu:                       "secretKeyRef":
03:08:53.563 STDOUT tofu:                         "key": "token"
03:08:53.563 STDOUT tofu:                         "name": "authentik-secrets"
03:08:53.563 STDOUT tofu:                   - "name": "AUTHENTIK_BOOTSTRAP_TOKEN"
03:08:53.563 STDOUT tofu:                     "valueFrom":
03:08:53.563 STDOUT tofu:                       "secretKeyRef":
03:08:53.563 STDOUT tofu:                         "key": "token"
03:08:53.563 STDOUT tofu:                         "name": "authentik-secrets"
03:08:53.563 STDOUT tofu:                   - "name": "POSTGRES_PASSWORD"
03:08:53.564 STDOUT tofu:                     "valueFrom":
03:08:53.564 STDOUT tofu:                       "secretKeyRef":
03:08:53.564 STDOUT tofu:                         "key": "postgresql-password"
03:08:53.564 STDOUT tofu:                         "name": "authentik-secrets"
03:08:53.564 STDOUT tofu:                 "postgresql":
03:08:53.564 STDOUT tofu:                   "auth":
03:08:53.564 STDOUT tofu:                     "existingSecret": "authentik-secrets"
03:08:53.564 STDOUT tofu:                     "secretKeys":
03:08:53.564 STDOUT tofu:                       "userPasswordKey": "postgresql-password"
03:08:53.564 STDOUT tofu:                   "enabled": true
03:08:53.564 STDOUT tofu:                   "primary":
03:08:53.564 STDOUT tofu:                     "persistence":
03:08:53.564 STDOUT tofu:                       "accessModes":
03:08:53.564 STDOUT tofu:                       - "ReadWriteOnce"
03:08:53.564 STDOUT tofu:                       "size": "4Gi"
03:08:53.564 STDOUT tofu:                       "storageClass": "longhorn"
03:08:53.564 STDOUT tofu:                       "volumeName": "authentik-postgres"
03:08:53.564 STDOUT tofu:                 "redis":
03:08:53.564 STDOUT tofu:                   "enabled": true
03:08:53.564 STDOUT tofu:                   "master":
03:08:53.564 STDOUT tofu:                     "persistence":
03:08:53.564 STDOUT tofu:                       "accessModes":
03:08:53.564 STDOUT tofu:                       - "ReadWriteOnce"
03:08:53.564 STDOUT tofu:                       "size": "2Gi"
03:08:53.564 STDOUT tofu:                       "storageClass": "local-path"
03:08:53.564 STDOUT tofu:                       "volumeName": "authentik-redis"
03:08:53.564 STDOUT tofu:                 "server":
03:08:53.564 STDOUT tofu:                   "ingress":
03:08:53.564 STDOUT tofu:                     "enabled": true
03:08:53.564 STDOUT tofu:                     "hosts":
03:08:53.564 STDOUT tofu:                     - "auth.tkasolutions.com.br"
03:08:53.564 STDOUT tofu:                     "ingressClassName": "traefik"
03:08:53.564 STDOUT tofu:             EOT,
03:08:53.564 STDOUT tofu:           + <<-EOT
03:08:53.564 STDOUT tofu:                 "authentik":
03:08:53.564 STDOUT tofu:                   "bootstrap_email": "youri@youhide.com.br"
03:08:53.564 STDOUT tofu:                   "email":
03:08:53.564 STDOUT tofu:                     "from": "Authentik <postmaster@mg.tkasolutions.com.br>"
03:08:53.564 STDOUT tofu:                     "host": "smtp.mailgun.org"
03:08:53.564 STDOUT tofu:                     "port": 587
03:08:53.564 STDOUT tofu:                     "use_tls": true
03:08:53.564 STDOUT tofu:                     "username": "postmaster@mg.tkasolutions.com.br"
03:08:53.564 STDOUT tofu:                 "global":
03:08:53.564 STDOUT tofu:                   "env":
03:08:53.564 STDOUT tofu:                   - "name": "AUTHENTIK_SECRET_KEY"
03:08:53.564 STDOUT tofu:                     "valueFrom":
03:08:53.565 STDOUT tofu:                       "secretKeyRef":
03:08:53.565 STDOUT tofu:                         "key": "authentik-secret-key"
03:08:53.565 STDOUT tofu:                         "name": "authentik-secrets"
03:08:53.565 STDOUT tofu:                   - "name": "AUTHENTIK_EMAIL__PASSWORD"
03:08:53.565 STDOUT tofu:                     "valueFrom":
03:08:53.565 STDOUT tofu:                       "secretKeyRef":
03:08:53.565 STDOUT tofu:                         "key": "smtp-password"
03:08:53.565 STDOUT tofu:                         "name": "authentik-secrets"
03:08:53.565 STDOUT tofu:                   - "name": "AUTHENTIK_BOOTSTRAP_PASSWORD"
03:08:53.565 STDOUT tofu:                     "valueFrom":
03:08:53.565 STDOUT tofu:                       "secretKeyRef":
03:08:53.565 STDOUT tofu:                         "key": "token"
03:08:53.565 STDOUT tofu:                         "name": "authentik-secrets"
03:08:53.565 STDOUT tofu:                   - "name": "AUTHENTIK_BOOTSTRAP_TOKEN"
03:08:53.565 STDOUT tofu:                     "valueFrom":
03:08:53.565 STDOUT tofu:                       "secretKeyRef":
03:08:53.565 STDOUT tofu:                         "key": "token"
03:08:53.565 STDOUT tofu:                         "name": "authentik-secrets"
03:08:53.565 STDOUT tofu:                   - "name": "POSTGRES_PASSWORD"
03:08:53.565 STDOUT tofu:                     "valueFrom":
03:08:53.565 STDOUT tofu:                       "secretKeyRef":
03:08:53.565 STDOUT tofu:                         "key": "postgresql-password"
03:08:53.565 STDOUT tofu:                         "name": "authentik-secrets"
03:08:53.565 STDOUT tofu:                 "postgresql":
03:08:53.565 STDOUT tofu:                   "auth":
03:08:53.565 STDOUT tofu:                     "existingSecret": "authentik-secrets"
03:08:53.565 STDOUT tofu:                     "secretKeys":
03:08:53.565 STDOUT tofu:                       "userPasswordKey": "postgresql-password"
03:08:53.565 STDOUT tofu:                   "enabled": true
03:08:53.565 STDOUT tofu:                   "primary":
03:08:53.565 STDOUT tofu:                     "persistence":
03:08:53.565 STDOUT tofu:                       "accessModes":
03:08:53.565 STDOUT tofu:                       - "ReadWriteOnce"
03:08:53.565 STDOUT tofu:                       "size": "4Gi"
03:08:53.565 STDOUT tofu:                       "storageClass": "longhorn"
03:08:53.565 STDOUT tofu:                       "volumeName": "authentik-postgres-volume"
03:08:53.565 STDOUT tofu:                 "redis":
03:08:53.565 STDOUT tofu:                   "enabled": true
03:08:53.565 STDOUT tofu:                   "master":
03:08:53.565 STDOUT tofu:                     "persistence":
03:08:53.565 STDOUT tofu:                       "accessModes":
03:08:53.565 STDOUT tofu:                       - "ReadWriteOnce"
03:08:53.566 STDOUT tofu:                       "size": "2Gi"
03:08:53.566 STDOUT tofu:                       "storageClass": "longhorn"
03:08:53.566 STDOUT tofu:                       "volumeName": "authentik-redis-volume"
03:08:53.566 STDOUT tofu:                 "server":
03:08:53.566 STDOUT tofu:                   "ingress":
03:08:53.566 STDOUT tofu:                     "enabled": true
03:08:53.566 STDOUT tofu:                     "hosts":
03:08:53.566 STDOUT tofu:                     - "auth.tkasolutions.com.br"
03:08:53.566 STDOUT tofu:                     "ingressClassName": "traefik"
03:08:53.566 STDOUT tofu:             EOT,
03:08:53.566 STDOUT tofu:         ]
03:08:53.566 STDOUT tofu:         # (26 unchanged attributes hidden)
03:08:53.566 STDOUT tofu:     }
03:08:53.566 STDOUT tofu:   # kubernetes_manifest.authentik_external_secret will be updated in-place
03:08:53.566 STDOUT tofu:   ~ resource "kubernetes_manifest" "authentik_external_secret" {
03:08:53.566 STDOUT tofu:       ~ object   = {
03:08:53.566 STDOUT tofu:           ~ spec       = {
03:08:53.566 STDOUT tofu:               ~ refreshInterval = "1h0m0s" -> "1h"
03:08:53.566 STDOUT tofu:                 # (5 unchanged attributes hidden)
03:08:53.566 STDOUT tofu:             }
03:08:53.566 STDOUT tofu:             # (3 unchanged attributes hidden)
03:08:53.566 STDOUT tofu:         }
03:08:53.566 STDOUT tofu:         # (1 unchanged attribute hidden)
03:08:53.566 STDOUT tofu:     }
03:08:53.566 STDOUT tofu: Plan: 0 to add, 2 to change, 0 to destroy.
03:08:53.566 STDOUT tofu:
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d terragrunt/kubernetes/authentik -w terragrunt_kubernetes_authentik
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://atlantis.localdomain:4141/lock?id=youhide%252FhideForming%252Fterragrunt%252Fkubernetes%252Fauthentik%252Fterragrunt_kubernetes_authentik)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d terragrunt/kubernetes/authentik -w terragrunt_kubernetes_authentik
  ```
Plan: 0 to add, 2 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```